app/views/comments/_comment.html.erb

                         data: { confirm: 'Are you sure?' } %></td>
    <td><%= comment.created_at%></td>
---
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "body01"], ["commenter", "commenter01"], ["created_at", "2015-01-06 06:57:18.041573"], ["post_id", 103], ["updated_at", "2015-01-06 06:57:18.041573"]]