app/views/posts/index.html.erb

        <td>
          <%= a.comments.count%>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]