app/views/posts/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
---
<h2>Comments</h2>
<%= render @post.comments.order(created_at: :desc) %>