app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "comment01"], ["commenter", "cmter01"], ["created_at", "2015-01-06 01:40:29.350931"], ["post_id", 1], ["updated_at", "2015-01-06 01:40:29.350931"]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 10 OFFSET 0  [["post_id", 103]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 103]]
---
  def create
    @post = current_user.posts.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
    @comments = @post.comments.order(created_at: :desc).paginate(page: params[:page], per_page: 10)