app/controllers/posts_controller.rb

  def index
    @posts = current_user.posts.all.paginate(page: params[:page], per_page: 15)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? LIMIT 15 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 1]]

  def create
    @post = current_user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("created_at", "slug", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-06 04:19:15.067976"], ["slug", "post101"], ["text", "post101"], ["title", "post101"], ["updated_at", "2015-01-06 04:19:15.067976"], ["user_id", 1]]

  def edit
    @post = current_user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]

  def show
    @post = current_user.posts.find(params[:id])
    @comments = @post.comments.all.paginate(page: params[:page], per_page: 15)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 15 OFFSET 0  [["post_id", 1]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]

  def destroy
    @post = current_user.posts.find(params[:id])
    if @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]